import axios from "axios";
import { FormEventHandler, useRef } from "react";
import Footer from "../components/footer/Footer";
import { Carousel } from "react-bootstrap";

export default function Contact() {

  return (<div>
      <p className="pt-5">Contact</p>
      <p className="pt-5">Contact</p>
      <p className="pt-5">Contact</p>
      <div className="d-flex flex-wrap justify-content-center  mb-5">
        <img
          src="https://z-lisu.in.ua/image/cache/catalog/Products/Jam/20171221220807_IMG_1506-470x470.jpg"
          alt=""
        />
        <img
          src="https://z-lisu.in.ua/image/cache/catalog/Products/Jam/chornychne_jam-470x470.jpg"
          alt=""
        />
        <img
          src="https://z-lisu.in.ua/image/cache/catalog/Products/Jam/lokhyna1-470x470.jpg"
          alt=""
        />
        <img
          src="https://z-lisu.in.ua/image/cache/catalog/Products/Jam/20171221220807_IMG_1506-470x470.jpg"
          alt=""
        />
        <img
          src="https://z-lisu.in.ua/image/cache/catalog/Products/Jam/lokhyna1-470x470.jpg"
          alt=""
        />
        <img
          src="https://z-lisu.in.ua/image/cache/catalog/Products/Jam/chornychne_jam-470x470.jpg"
          alt=""
        />
        <img
          src="https://z-lisu.in.ua/image/cache/catalog/Products/Jam/20171221220807_IMG_1506-470x470.jpg"
          alt=""
        />
        <img
          src="https://z-lisu.in.ua/image/cache/catalog/Products/Jam/chornychne_jam-470x470.jpg"
          alt=""
        />
        <img
          src="https://z-lisu.in.ua/image/cache/catalog/Products/Jam/lokhyna1-470x470.jpg"
          alt=""
        />
      </div>
      <div className="d-flex flex-wrap justify-content-center mt-5 mb-5 m-5 textt">
        <h1>Виготовлення варення</h1>
        <p className="textt inherit Helvetica Neue">
          Варення готують майже з усіх плодів кісточкових, зерняткових та
          ягідних культур. У готовому варенні плоди мають зберігатися цілими
          певної форми, насичені цукровим сиропом, з відповідними ароматом і
          смаком. Сироп у варенні повинен бути прозорим. Для виготовлення
          варення беруть дозрілі плоди (перезрілі роз­варюються, варення з
          недозрілих плодів неароматне, містить грубі частинки). Процес
          приготування варення здійснюється так, щоб дифузія, забезпечуючи
          високу концентрацію цукру в плодах, не призводила до їх зморщування чи
          до розривання тканин. Потрібно щоб сировина була однорідною за
          розмірами, ступенем зрілості, ко­льором плодів та вмістом кислот.
          Абрикоси перед варінням наколюють або, якщо плоди мають розмір більше
          35 мм, розрізають на половинки і видаляють кісточ­ки; ананаси ріжуть
          на шматочки 10 — 12 мм.
        </p>
        <p className="Helvetica Neue">
          Виноград відокремлю­ють від гребенів і сортують за розмірами ягід;
          плоди зерняткових очищають від плодоніжок, чашечок та насінного
          гнізда, нарізають шматочками завтовшки 15 — 25 мм і завдовжки не
          більше 30 мм. Кісточкові звільняють від плодоніжок, дрібні сливи й
          аличу варять цілими, а великі або розділяють на половинки і викидають
          кісточ­ки, або надрізають з одного боку до кісточки. Дрібноплідні
          персики розрізають на половинки, а крупноплідні — на 4 — 8 шматочків.
          Плоди брусниці, буяхів, журавлини, чорниці очищають від плодо­ніжок
          (журавлину, брусницю бланшують). Дині очищають від шкі­рочки, насіння
          та м'якоті, ріжуть на шматочки до 50 мм, бланшують не більше 10 хв у
          киплячій воді або 5 — 7 хв у 5 — 10 %-му цукровому сиропі при 90 —
          100°C. Волоські горіхи кип'ятять 3 — 5 хв у 5 %-му розчині каустичної
          соди, потім миють і витримують 2 доби у холодній воді, міняючи її
          через кожні 6 год доти, поки вона перестане за­барвлюватись. Після
          цього горіхи обробляють протягом 24 год в 7 — 10 %-му розчині вапна
          (вони набувають темно-фіолетового забарв­лення і твердості),
          промивають холодною водою доти, поки вода пе­рестане забарвлюватись,
          наколюють, бланшують 20 — 25 хв в 1 — 6 %-му киплячому розчині
          алюмокалієвих галунів (на 100 кг плодів 800 г галунів), витримують у
          холодній воді, бланшують 20 — 30 хв у 5 %-му цукровому сиропі або
          гарячій воді. Плоди ягідних культур переробляють у день збирання.
          Цитрусові можна довше зберігати, але в невеликій тарі. Концентрація
          цукрового сиропу: для варення з винограду, дині, пелюсток троянд,
          інжиру — до 40 %, для абрикос, персиків, череш­ні, манго 40 — 55;
          гуаяви, лимонів, манго 75 — 80; айви, груш, яблук, слив-ренклодів 40 —
          55; винограду, черешні, ткемалі, мандаринів 50 — 55; брусниці, буяхів,
          дині, суниць, полуниць, журавлини, чор­ниці, смородини 70 — 75 %.
          Перед варінням плоди заливають гарячим цукровим сиропом і витримують 3
          — 4 год для поступової дифузії цукру в плоди. Виног­рад, вишні,
          смородину варять зразу, поступово доводячи до кипіння, оскільки при
          високій температурі сік закипає всередині плода, що утруднює
          проникнення в нього сиропу.
        </p>
        <p>
          Тому фрукти варять при слабкому кипінні, чергуючи охолодження й
          нагрівання. При охоло­дженні знижується пружність водяної пари у
          тканинах плодів, утворюється вакуум, що поліпшує проникнення в них
          сиропу. Ва­рення варять у двостінних котлах невеликої місткості (до 12
          кг), щоб уникнути деформації плодів. Варіння буває одно- чи
          багаторазовим. Плоди, які не розварю­ються і добре просочуються
          сиропом (малина, журавлина, суниця, ожина), варять за один раз
          протягом не більше 40 хв, попередньо витримавши їх 8—10 год у цукрі.
          Інші плоди варять багаторазово, доводять до слабкого кипіння і варять
          кілька хвилин, потім вили­вають у мілку тару і залишають на 15 - 20
          год. Інколи уварюють лише сироп без плодів, а останній раз — з
          плодами. Для вишень, черешень, смородини достатньо дворазового
          варіння. Виноград, аб­рикос, персики (половинками), сливи, дині варять
          тричі. Плоди зе­рняткових, сливи, абрикоси, аґрус — чотири; мандарини
          — п'ять разів. Тривалість варіння не повинна перевищувати 30 хв.
          Закін­чення варіння визначають за допомогою рефрактометра: для
          непас-теризованого варення 70 % СР в охолодженій краплі сиропу, для
          пастеризованого (крапля не розпливається) — 68 %. Найдосконалішим є
          виготовлення варення у вакуум-апаратах. Спочатку створюється вакуум у
          порожньому котлі, потім подається сироп, який доводиться до кипіння.
          Через люк у верхній частині завантажують попередньо витримані в
          гарячому сиропі плоди. Дрібні плоди надходять одночасно з сиропом.
          Після завантаження пода­ється пара, створюється вакуум. Готовий
          продукт фасують, закупо­рюють, стерилізують при 100 °С. Вміст сухих
          речовин у ньому ста­новить 60 - 70 %. Причини зацукрювання варення:
          при охолодженні розчинність цукрів знижується і сироп стає
          перенасиченим; механічні перемі­щення; тривале варіння. Кислотність
          варення повинна становити 0,5 %. Якщо вміст кислот недостатній,
          додають лимонну кислоту. При великій кількості кислот сахароза
          повністю інвертується, від­бувається глюкозне зацукрювання з
          утворенням довгастих криста­лів. Щоб запобігти цьому, треба зменшити
          тривалість варіння.
        </p>
      </div>
      <div className="  justify-content-center ">
        <Carousel className="d-flex  justify-content-center ">
          <Carousel.Item>
            <img
              className="d-block w-100 h-25"
              src="https://www.seriouseats.com/thmb/3y-u37GlUx725wdy3iGQLlSfyNQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__07__20150623-plum-jam-recipe-primary-02-60251910efcd43c08c23567461150e9d.jpg"
              alt="Second slide"
            />
            <Carousel.Caption>
              <h3>Варення з полуниці</h3>
            </Carousel.Caption>
          </Carousel.Item>
         
        </Carousel>
      </div>
      <Footer />
      <Footer />
    </div>);
}
